In [1]:
data = { 

    'Name' : [ 'x','y','z','p','q'],
    'Science' : [ 56,76,80,65,55],
    'English' : [ 66,78,77,98,44],
    'Maths' : [55,66,87,67,78],

    }

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(data=data,columns=data.keys(),)

In [4]:
df

  Name  Science  English  Maths
0    x       56       66     55
1    y       76       78     66
2    z       80       77     87
3    p       65       98     67
4    q       55       44     78

In [5]:
df.sort_index(axis=1)

   English  Maths Name  Science
0       66     55    x       56
1       78     66    y       76
2       77     87    z       80
3       98     67    p       65
4       44     78    q       55

In [6]:
df = df.T

In [10]:
df

          0   1   2   3   4
Name      x   y   z   p   q
Science  56  76  80  65  55
English  66  78  77  98  44
Maths    55  66  87  67  78